In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
TrainDf=pd.read_csv('train.csv')

In [3]:
TrainDf.head(1)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370

In [4]:
TrainDf.isna().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [5]:
TestDf=pd.read_csv('test.csv')

In [6]:
TestDf.head(1)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN

In [7]:
TestDf.isna().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2             72344
Product_Category_3            162562
dtype: int64

# Null Value Imputation

In [8]:
def impute_na(df, variable):
    mean = df[variable].mean()
    df[variable] = df[variable].fillna(mean)

In [9]:
impute_na(TrainDf, 'Product_Category_2')

In [10]:
impute_na(TrainDf, 'Product_Category_3')

In [11]:
impute_na(TestDf, 'Product_Category_2')

In [12]:
impute_na(TestDf, 'Product_Category_3')

In [13]:
TrainDf.isna().sum()

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
Purchase                      0
dtype: int64

** Getting rid of constant non significant columns **

In [14]:
del TrainDf['User_ID']
del TrainDf['Product_ID']

In [15]:
del TestDf['User_ID']
del TestDf['Product_ID']

**All columns have NOT NULL values now**

In [16]:
TestDf.head(1)

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,M,46-50,7,B,2,1,1,11.0,12.669454

In [17]:
TrainDf.head(1)

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,F,0-17,10,A,2,0,3,9.842329,12.668243,8370

In [18]:
TrainDf['Gender'].unique()

array(['F', 'M'], dtype=object)

In [19]:
TrainDf['City_Category'].unique()

array(['A', 'C', 'B'], dtype=object)

In [20]:
TrainDf['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

# Categerical Encoding#

In [21]:
# encoding for "gender","City_Category"
TrainDf=pd.get_dummies(TrainDf, drop_first=True, columns=['Gender','City_Category'])

In [22]:
TrainDf.head(1)

,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Gender_M,City_Category_B,City_Category_C
0,0-17,10,2,0,3,9.842329,12.668243,8370,0,0,0

In [23]:
TestDf=pd.get_dummies(TestDf, drop_first=True, columns=['Gender','City_Category'])

In [24]:
#encoding for "Age"
age_dict = TrainDf.Age.value_counts().to_dict()
TrainDf['Age'] = TrainDf['Age'].map(age_dict)

In [25]:
TrainDf.head(5)

,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Gender_M,City_Category_B,City_Category_C
0,15102,10,2,0,3,9.842329,12.668243,8370,0,0,0
1,15102,10,2,0,1,6.000000,14.000000,15200,0,0,0
2,15102,10,2,0,12,9.842329,12.668243,1422,0,0,0
3,15102,10,2,0,12,14.000000,12.668243,1057,0,0,0
4,21504,16,4+,0,8,9.842329,12.668243,7969,1,0,1

In [26]:
age_dict = TestDf.Age.value_counts().to_dict()
TestDf['Age'] = TestDf['Age'].map(age_dict)

In [27]:
TrainDf['Stay_In_Current_City_Years'].unique()

array(['2', '4+', '3', '1', '0'], dtype=object)

In [28]:
TestDf['Stay_In_Current_City_Years'].unique()

array(['2', '0', '4+', '1', '3'], dtype=object)

* Stay_In_Current_City_Years has one nonnumeric value*

In [29]:
TrainDf['Stay_In_Current_City_Years'] = TrainDf['Stay_In_Current_City_Years'].apply(lambda x:4 if x == '4+' else x)

In [30]:
TestDf['Stay_In_Current_City_Years'] = TestDf['Stay_In_Current_City_Years'].apply(lambda x:4 if x == '4+' else x)

In [31]:
TrainDf.head(5)

,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Gender_M,City_Category_B,City_Category_C
0,15102,10,2,0,3,9.842329,12.668243,8370,0,0,0
1,15102,10,2,0,1,6.000000,14.000000,15200,0,0,0
2,15102,10,2,0,12,9.842329,12.668243,1422,0,0,0
3,15102,10,2,0,12,14.000000,12.668243,1057,0,0,0
4,21504,16,4,0,8,9.842329,12.668243,7969,1,0,1

In [32]:
TestDf.head(1)

,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Gender_M,City_Category_B,City_Category_C
0,19577,7,2,1,1,11.0,12.669454,1,1,0

** SPLITING DATA INTO TEST AND TRAIN **

In [33]:
X = TrainDf.iloc[:,[0,1,2,3,4,5,6,8,9]].values
y = TrainDf.iloc[:, 7].values

X2 = TestDf.iloc[:].values

In [34]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.30, 
                                                    random_state = 45)

In [35]:
# Feature Scaling
from sklearn.preprocessing import StandardScaler, MinMaxScaler
sc_X = StandardScaler()
X_train = sc_X.fit_transform(X_train)
meanX = sc_X.mean_
varX = sc_X.var_


X_test = sc_X.transform(X_test)

C:\Users\Barnali PC\Anaconda3\lib\site-packages\sklearn\utils\validation.py:595: DataConversionWarning: Data with input dtype object was converted to float64 by StandardScaler.
  warnings.warn(msg, DataConversionWarning)
C:\Users\Barnali PC\Anaconda3\lib\site-packages\sklearn\utils\validation.py:595: DataConversionWarning: Data with input dtype object was converted to float64 by StandardScaler.
  warnings.warn(msg, DataConversionWarning)
C:\Users\Barnali PC\Anaconda3\lib\site-packages\sklearn\utils\validation.py:595: DataConversionWarning: Data with input dtype object was converted to float64 by StandardScaler.
  warnings.warn(msg, DataConversionWarning)

In [36]:
# Fitting Random Forest Regression to the dataset
from sklearn.ensemble import RandomForestRegressor
regressor = RandomForestRegressor(n_estimators = 150, random_state = 0)
regressor.fit(X_train, y_train)

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
           max_features='auto', max_leaf_nodes=None,
           min_impurity_decrease=0.0, min_impurity_split=None,
           min_samples_leaf=1, min_samples_split=2,
           min_weight_fraction_leaf=0.0, n_estimators=150, n_jobs=None,
           oob_score=False, random_state=0, verbose=0, warm_start=False)

In [37]:
cols=TrainDf.columns.difference(['Purchase'])

In [38]:
    def feature_select(X, y, cols, cutoff):
        regressor = RandomForestRegressor(n_estimators = 150, random_state = 0)
        regressor.fit(X, y)
        feat_imps = pd.concat([pd.DataFrame(cols, columns=['Features']),
                           pd.DataFrame(regressor.feature_importances_, columns=['Importances'])],
                         axis=1)
        feat_imps = feat_imps.sort_values(['Importances'], ascending=False)
        feat_imps['Cumulative Importances'] = feat_imps['Importances'].cumsum()
        feat_imps = feat_imps[feat_imps['Cumulative Importances'] < cutoff]
        return feat_imps['Features'].tolist()

In [39]:
imp_cols = feature_select(X, y, cols, 0.990)

In [40]:
X=TrainDf[imp_cols].values
y = TrainDf.iloc[:,7].values
X2=TestDf[imp_cols].values

In [41]:
# Splitting the dataset into the Training set and Test set
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, 
                                                    test_size = 0.4, 
                                                    random_state = 100)

In [42]:
# Feature Scaling
from sklearn.preprocessing import StandardScaler, MinMaxScaler
sc_X = StandardScaler()
X_train = sc_X.fit_transform(X_train)
meanX = sc_X.mean_
varX = sc_X.var_

X_test = sc_X.transform(X_test)

In [43]:
# Fitting Multi Linear Regression to the Training set
from sklearn.linear_model import LinearRegression
regressor = LinearRegression(n_jobs=-1)
regressor.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=-1, normalize=False)

In [44]:
#1
from sklearn.metrics import mean_squared_error
print('RMSE for Multi Linear Regression with Selected Features: ',
      mean_squared_error(y_test,regressor.predict(X_test))**0.5)

RMSE for Multi Linear Regression with Selected Features:  4698.725375285584

In [45]:
from sklearn.tree import DecisionTreeRegressor
dtregressor = DecisionTreeRegressor( max_depth= 3,random_state = 2)
dtregressor.fit(X_train, y_train)

DecisionTreeRegressor(criterion='mse', max_depth=3, max_features=None,
           max_leaf_nodes=None, min_impurity_decrease=0.0,
           min_impurity_split=None, min_samples_leaf=1,
           min_samples_split=2, min_weight_fraction_leaf=0.0,
           presort=False, random_state=2, splitter='best')

In [46]:
from sklearn.metrics import mean_squared_error
print('RMSE for Multi Linear Regression with Selected Features: ',
      mean_squared_error(y_test,dtregressor.predict(X_test))**0.5)

RMSE for Multi Linear Regression with Selected Features:  3760.1041867254658

In [47]:
# Fitting Random Forest Regression to the dataset
from sklearn.ensemble import RandomForestRegressor
rf_regressor = RandomForestRegressor(n_estimators = 10, random_state = 0)
rf_regressor.fit(X_train, y_train)

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
           max_features='auto', max_leaf_nodes=None,
           min_impurity_decrease=0.0, min_impurity_split=None,
           min_samples_leaf=1, min_samples_split=2,
           min_weight_fraction_leaf=0.0, n_estimators=10, n_jobs=None,
           oob_score=False, random_state=0, verbose=0, warm_start=False)

In [48]:
#2
print('RMSE for Multi Linear Regression with Selected Features: ',
      mean_squared_error(y_test,regressor.predict(X_test))**0.5)
print('RMSE for Random Forest Regression with Selected Features: ',
      mean_squared_error(y_test,rf_regressor.predict(X_test))**0.5)

RMSE for Multi Linear Regression with Selected Features:  4698.725375285584
RMSE for Random Forest Regression with Selected Features:  3053.8645135708207

In [51]:
from sklearn.ensemble import AdaBoostRegressor
adb = AdaBoostRegressor(base_estimator=dtregressor, n_estimators=31,random_state=1)
adb.fit(X_train, y_train)

AdaBoostRegressor(base_estimator=DecisionTreeRegressor(criterion='mse', max_depth=3, max_features=None,
           max_leaf_nodes=None, min_impurity_decrease=0.0,
           min_impurity_split=None, min_samples_leaf=1,
           min_samples_split=2, min_weight_fraction_leaf=0.0,
           presort=False, random_state=2, splitter='best'),
         learning_rate=1.0, loss='linear', n_estimators=31, random_state=1)

In [52]:
print('RMSE for Multi Linear Regression with Selected Features: ',
      mean_squared_error(y_test,regressor.predict(X_test))**0.5)
print('RMSE for Random Forest Regression with Selected Features: ',
      mean_squared_error(y_test,rf_regressor.predict(X_test))**0.5)
print('RMSE for Adaboost Regression with Selected Features: ',
      mean_squared_error(y_test,adb.predict(X_test))**0.5)

RMSE for Multi Linear Regression with Selected Features:  4698.725375285584
RMSE for Random Forest Regression with Selected Features:  3053.8645135708207
RMSE for Adaboost Regression with Selected Features:  3625.666193817504

In [63]:
X

array([16522.6       ,  7752.11666667,   430.15      , ...,
       16522.6       ,   349.64166667,   360.49010823])

## X2=rf_regressor.predict(X2)

In [ ]:
pd.DataFrame(final).to_csv("BlckFridayResult.csv",header=None, index=False)